# Задание №1.
# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке.
# Ввод:

# пара-ра-рам рам-пам-папам па-ра-па-да

# Вывод:
# Парам пам-пам


poem = input("Winnie the Pooh, please enter your poem: ")
phrases = poem.split()
first_count = sum(1 for letter in phrases[0] if letter.lower() in "aeiouy")
for phrase in phrases[1:]:
    count = sum(1 for letter in phrase if letter.lower() in "aeiouy")
    if count != first_count:
        print("Pam pam pam")
        break
else:
    print("Param pam pam")